## Plan Result (prod_gaps2 - TerraformPlanApply)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.storage_account.azurerm_private_endpoint.this[0]
* Update
  * module.storage_account.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.storage_account.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "hmctsgaps2prodsftp"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "gaps2-prod-rg"
      + subnet_id                = "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/jumpbox-prod-rg/providers/Microsoft.Network/virtualNetworks/jumpbox-prod-vnet/subnets/gaps2-subnet"
      + tags                     = {
          + "application"  = "gaps2"
          + "builtFrom"    = "hmcts/gaps2-infrastructure"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "hmctsgaps2prodsftp"
          + private_connection_resource_id = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/gaps2-prod-rg/providers/Microsoft.Storage/storageAccounts/hmctsgaps2prodsftp"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/gaps2-prod-rg/providers/Microsoft.Storage/storageAccounts/hmctsgaps2prodsftp"
        name                               = "hmctsgaps2prodsftp"
        tags                               = {
            "application"  = "gaps2"
            "builtFrom"    = "hmcts/gaps2-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ virtual_network_subnet_ids = [
              + "/subscriptions/2b1afc19-5ca9-4796-a56f-574a58670244/resourceGroups/jumpbox-prod-rg/providers/Microsoft.Network/virtualNetworks/jumpbox-prod-vnet/subnets/gaps2-subnet",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":8,"Program":"tfcmt","SHA1":"","Target":"prod_gaps2 - TerraformPlanApply","Vars":{}} -->